
#### Terraform Plan `success`
<details><summary>Plan: 2 to add, 0 to change, 2 to destroy.
</summary>

```
azurerm_resource_group.github_tech_challenge: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge]
azurerm_app_service_plan.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/serverfarms/github-branch-protection-service]
azurerm_storage_account.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Storage/storageAccounts/liatriogithubtech]
azurerm_function_app.branch_protection_service: Refreshing state... [id=/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/sites/github-branch-protection-service]
github_organization_webhook.branch_protection_service: Refreshing state... [id=337096227]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_function_app.branch_protection_service has changed
  ~ resource "azurerm_function_app" "branch_protection_service" {
      ~ app_settings                    = {
          + "WEBSITE_ENABLE_SYNC_UPDATE_SITE" = "true"
          ~ "WEBSITE_RUN_FROM_PACKAGE"        = "" -> "1"
            # (4 unchanged elements hidden)
        }
        id                              = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/sites/github-branch-protection-service"
        name                            = "github-branch-protection-service"
        tags                            = {}
        # (21 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service_plan.branch_protection_service must be replaced
-/+ resource "azurerm_app_service_plan" "branch_protection_service" {
      ~ id                           = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/serverfarms/github-branch-protection-service" -> (known after apply)
      - is_xenon                     = false -> null
      ~ kind                         = "Windows" -> "Linux" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 10 -> (known after apply)
        name                         = "github-branch-protection-service"
      - per_site_scaling             = false -> null
      ~ reserved                     = false -> true
      - tags                         = {} -> null
      - zone_redundant               = false -> null
        # (2 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 1 -> (known after apply)
          ~ size     = "S1" -> "Y1"
          ~ tier     = "Standard" -> "Dynamic"
        }
    }

  # azurerm_function_app.branch_protection_service must be replaced
-/+ resource "azurerm_function_app" "branch_protection_service" {
      ~ app_service_plan_id             = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/serverfarms/github-branch-protection-service" -> (known after apply)
      ~ app_settings                    = {
          - "WEBSITE_ENABLE_SYNC_UPDATE_SITE" = "true" -> null
          - "WEBSITE_NODE_DEFAULT_VERSION"    = "node|14" -> null
          ~ "WEBSITE_RUN_FROM_PACKAGE"        = "1" -> ""
            # (3 unchanged elements hidden)
        }
      ~ client_affinity_enabled         = false -> (known after apply)
      - client_cert_mode                = "" -> null
      ~ custom_domain_verification_id   = "3F57FCE82A29CEC5ADE3F2CFCB6A94E049D14E9AFFE902C8324F9C9446ECCE76" -> (known after apply)
      - daily_memory_time_quota         = 0 -> null
      ~ default_hostname                = "github-branch-protection-service.azurewebsites.net" -> (known after apply)
      ~ id                              = "/subscriptions/3e16852e-8399-4c16-b246-16bf46bc3747/resourceGroups/github-tech-challenge/providers/Microsoft.Web/sites/github-branch-protection-service" -> (known after apply)
      ~ key_vault_reference_identity_id = "SystemAssigned" -> (known after apply)
      ~ kind                            = "functionapp" -> (known after apply)
        name                            = "github-branch-protection-service"
      ~ os_type                         = "" -> "linux" # forces replacement
      ~ outbound_ip_addresses           = "13.89.107.89,13.89.111.22,40.89.242.187,40.89.242.197,40.89.243.134,40.89.243.169,20.40.202.8" -> (known after apply)
      ~ possible_outbound_ip_addresses  = "13.89.107.89,13.89.111.22,40.89.242.187,40.89.242.197,40.89.243.134,40.89.243.169,40.89.246.180,52.143.240.136,52.143.241.80,52.143.241.124,52.143.241.135,52.143.241.204,52.143.242.75,52.143.242.103,52.143.242.140,52.143.244.88,52.143.247.58,52.154.168.141,52.154.168.230,52.154.169.24,52.154.170.104,52.154.171.109,52.154.172.100,52.154.172.183,52.154.173.30,52.154.174.159,52.154.175.37,52.154.175.120,52.154.175.141,52.154.175.185,20.40.202.8" -> (known after apply)
      ~ site_credential                 = [
          - {
              - password = "pNjCKbkdANa1pd79PT9WmCHkxnB0sv7Z21vfh7vx8PbSp32QEw1Hwt1vJTpm"
              - username = "$github-branch-protection-service"
            },
        ] -> (known after apply)
      ~ storage_connection_string       = (sensitive value)
      - tags                            = {} -> null
      ~ version                         = "~1" -> "~3"
        # (7 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ site_config {
          ~ app_scale_limit                  = 0 -> (known after apply)
          ~ elastic_instance_minimum         = 1 -> (known after apply)
          ~ ftps_state                       = "AllAllowed" -> (known after apply)
          ~ ip_restriction                   = [] -> (known after apply)
          + linux_fx_version                 = "node|14"
          ~ min_tls_version                  = "1.2" -> (known after apply)
          ~ pre_warmed_instance_count        = 0 -> (known after apply)
          ~ scm_ip_restriction               = [] -> (known after apply)
          ~ scm_type                         = "None" -> (known after apply)
          ~ vnet_route_all_enabled           = false -> (known after apply)
            # (7 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "master" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          + repo_url           = (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>